bubbleColumn/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 5e+06;

boundaryField
{
    sideLeft
    {
        type            symmetryPlane;
    }
    sideRight
    {
        type            myWaveTransmissive;
        phi             phi.air;
        rho             rho.air;
        psi             thermo:psi.air;
        gamma           1.4;
        fieldInf        100000;
        lInf            10;
        value           uniform 100000;
    }
    topbottom
    {
        type            zeroGradient;
    }
    empty
    {
        type            empty;
    }
}


// ************************************************************************* //
