bubbleColumn/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    sideLeft
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          1;
        startFace       999;
    }
    sideRight
    {
        type            patch;
        nFaces          1;
        startFace       1000;
    }
    topbottom
    {
        type            patch;
        nFaces          2000;
        startFace       1001;
    }
    empty
    {
        type            empty;
        inGroups        1(empty);
        nFaces          2000;
        startFace       3001;
    }
)

// ************************************************************************* //
